app/views/requests/index.html.erb

<h1> Listings </h1>
<h3> Listings for <%=current_user.requests.last.datein%> to <%=current_user.requests.last.dateout%></h3>
---
SELECT  "requests".* FROM "requests"  WHERE "requests"."user_id" = ?  ORDER BY "requests"."id" DESC LIMIT 1  [["user_id", 1]]

<% finalcompare().each do |id| %>
<div class="searchlisting"><%= Listing.find(id).datein %>  <%= Listing.find(id).dateout %></div>
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]