app/controllers/listings_controller.rb

	def create
		@listing = current_user.listings.new(listing_params)
		@listing.save
---
INSERT INTO "listings" ("created_at", "datein", "dateout", "description", "location", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]

	def update
	  @listing = Listing.find(params[:id])

	  if @listing.update(listing_params)
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "listings" SET "location" = ?, "updated_at" = ? WHERE "listings"."id" = 5  [["location", "Edgewood Avenue new haven ct"], ["updated_at", "2014-07-08 17:27:40.010420"]]

	def index
		if user_signed_in?
		@listings = current_user.listings.all.reverse
---
SELECT "listings".* FROM "listings"  WHERE "listings"."user_id" = ?  [["user_id", 1]]