app/controllers/requests_controller.rb

INSERT INTO "requests" ("created_at", "datein", "dateout", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-08 17:22:01.525245"], ["datein", "07/17/2014"], ["dateout", "07/17/2014"], ["updated_at", "2014-07-08 17:22:01.525245"], ["user_id", 1]]
---
	def create
		@request = current_user.requests.new(request_params)
		@request.save